package to_0812_1;

public class Main {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//NHN 코테 문제 23.08.12 오후 2시-오후 4시 120분 시험 
		/*
		 *  문제 1)
		 *  // 각 cars[][] 배열에 들어온 1번 : 노랑, 2번: 빨강, 3번: 검정 4번: 도착지 일 때 (0은 항상 경유 가능)
		 *  1번에서 4번으로 0번만 거쳐도 갈 수 있으면 0 리턴, 갈 수 없으면 -1 리턴
		 *  1번에서 4번으로 0번, 2번 모두 거쳐서 갈 수 있으면, 빨강을 최소 거치는 개수 리턴 
		 *  
		 *  문제 2) 
		 *  // 입력으로 String command 값이 들어온다. 그 값은 어떤 키인데
		 *  //만약 String[] buttons 에서 들어온 입력값 중에 포함되는 값이 존재한다면 해당 i의 score[] 를 합친다.
		 *  그런데 여러 버튼의 조합으로도 중복되지 않게 command를 만들 수 있으면 그 score를 누적 가능 
		 *  //기본적으로 한 글자당 1점을 얻고, 더 큰 값이 되는 점수를 찾되, 최고값을 리턴 
		 *  
		 *  문제 3) 
		 *  // 최소신장트리 인데, 간선정보의 val값에 (0, 1, 2) 가 있다.  0은 +, 1은 - 2는 * 이다.
		 *  각 정점을 이었을 때, 그 연산정보를 참고하여 최고 값이 나오는 경우를 찾아 그 값을 리턴 
		 *  
		 * */
	}

}
